app/controllers/beans_controller.rb

SELECT "beans".* FROM "beans"
---
	def get_beans
		@all_beans = Bean.all

SELECT  "beans".* FROM "beans"  WHERE "beans"."id" = ? LIMIT 1  [["id", 0]]
INSERT INTO "beans" ("name", "country", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "lel"], ["country", "lul"], ["description", "lol"], ["created_at", "2018-09-18 19:52:12.498364"], ["updated_at", "2018-09-18 19:52:12.498364"]]
UPDATE "beans" SET "country" = ?, "description" = ?, "name" = ?, "updated_at" = ? WHERE "beans"."id" = 20  [["country", "a"], ["description", "a"], ["name", "a"], ["updated_at", "2015-01-25 00:27:29.600102"]]
---
    def save
    	if params[:beans].length > 0 then
	    	beans = params[:beans]
	    	beans.each do |bean|
	    		nb = nil
	    		if bean["id"] then
	    			nb = Bean.find bean["id"]
	    		end
	    		if not nb then
	    			nb = Bean.new
	    		end
    			nb.name = bean["name"]
    			nb.description = bean["description"]
    			nb.country = bean["country"]
				nb.save

SELECT  "beans".* FROM "beans"  WHERE "beans"."id" = ? LIMIT 1  [["id", 19]]
DELETE FROM "beans" WHERE "beans"."id" = ?  [["id", 19]]
---
    def remove
    	if params[:beans].length > 0 then
	    	beans = params[:beans]
	    	beans.each do |bean|
				ob = Bean.find bean["id"]
				ob.destroy