app/controllers/main_controller.rb

SELECT "users".* FROM "users"
---
	def get_users
		@all_users = User.all

SELECT "beans".* FROM "beans"
---
    def get_beans
		@all_beans = Bean.all

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 0]]
---
    def get_beans_of_user
    	userid = params[:curruser]
    	curruser = User.find(userid)

SELECT  "packages".* FROM "packages"  WHERE "packages"."id" = ? LIMIT 1  [["id", 9]]
---
	def get_beans_in_package
		packageid = params[:currpackage]
		currpackage = Package.find(packageid)

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 9]]
SELECT  "beans".* FROM "beans"  WHERE "beans"."id" = ? LIMIT 1  [["id", 48]]
---
	def mark_beans
		userid = params[:curruser]
    	curruser = User.find(userid)

    	params[:beans].each do |beanid|
    		curruser.beans << Bean.find(beanid)

SELECT "packages".* FROM "packages"
---
    def get_packages
		@all_packages = Package.all

SELECT  "beans".* FROM "beans"  WHERE "beans"."id" = ? LIMIT 1  [["id", 47]]
---
    def get_comments_of_bean
    	beanid = params[:beanid]
    	bean = Bean.find(beanid)

INSERT INTO "comments" ("body", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["body", "yo im bean one"], ["created_at", "2015-01-26 01:18:53.470665"], ["updated_at", "2015-01-26 01:18:53.470665"]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 9]]
SELECT  "beans".* FROM "beans"  WHERE "beans"."id" = ? LIMIT 1  [["id", 47]]
---
	def save_comment
		userid = params[:userid]
		beanid = params[:beanid]
		commentbody = params[:commentbody]

		comment = Comment.new
		comment.body = commentbody
		comment.save

		User.find(userid).comments << comment
		Bean.find(beanid).comments << comment

INSERT INTO "users" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2015-01-26 01:18:30.173975"], ["name", "Jordie"], ["updated_at", "2015-01-26 01:18:30.173975"]]
---
    def save_users
    	if params[:users].length > 0 then
	    	users = params[:users]
	    	users.each do |user|
	    		nu = nil
	    		if user["id"] then
	    			nu = User.find user["id"]
	    		end
	    		if not nu then
	    			nu = User.new
	    		end
    			nu.name = user["name"]
				nu.save

SELECT  "beans".* FROM "beans"  WHERE "beans"."id" = ? LIMIT 1  [["id", 20]]
INSERT INTO "beans" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2015-01-25 19:38:30.900333"], ["name", "asf"], ["updated_at", "2015-01-25 19:38:30.900333"]]
UPDATE "beans" SET "country" = ?, "description" = ?, "name" = ?, "updated_at" = ? WHERE "beans"."id" = 22  [["country", "usa"], ["description", "strong"], ["name", "bean1 "], ["updated_at", "2015-01-25 02:44:41.028323"]]
---
    def save_beans
    	if params[:beans].length > 0 then
	    	beans = params[:beans]
	    	beans.each do |bean|
	    		nb = nil
	    		if bean["id"] then
	    			nb = Bean.find bean["id"]
	    		end
	    		if not nb then
	    			nb = Bean.new
	    		end
    			nb.name = bean["name"]
    			nb.description = bean["description"]
    			nb.country = bean["country"]
				nb.save

INSERT INTO "packages" ("created_at", "name", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2015-01-26 01:19:22.429133"], ["name", "odd package"], ["updated_at", "2015-01-26 01:19:22.429133"], ["user_id", 1]]
SELECT  "beans".* FROM "beans"  WHERE "beans"."id" = ? LIMIT 1  [["id", 22]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "beans" SET "package_id" = ?, "updated_at" = ? WHERE "beans"."id" = 22  [["package_id", 6], ["updated_at", "2015-01-25 19:02:57.832443"]]
---
    def save_packages
    	if params[:packages].length > 0 then
	    	packages = params[:packages]
	    	packages.each do |package|
	    		print package
	    		np = nil
	    		if package["id"] then
	    			np = Package.find package["id"]
	    		end
	    		if not np then
	    			np = Package.new
	    		end
    			np.name = package["name"]
    			if package["beanids"] then
	    			package["beanids"].each do |id|
	    				np.beans << Bean.find(id)
	    			end
	    		end
    			np.user = User.find(package["ownerid"])
				np.save

SELECT  "beans".* FROM "beans"  WHERE "beans"."id" = ? LIMIT 1  [["id", 20]]
DELETE FROM "beans" WHERE "beans"."id" = ?  [["id", 20]]
---
    def remove_beans
    	if params[:beans].length > 0 then
	    	beans = params[:beans]
	    	beans.each do |bean|
				ob = Bean.find bean["id"]
				ob.destroy